# Id Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitCommandId..::..Id Property
RevitCommandId Class See Also
---
The command id.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public uint Id { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Id As UInteger
	Get
```

Visual C++
---
```text
public:
property unsigned int Id {
	unsigned int get ();
}
```

# See Also
RevitCommandId Class
Autodesk.Revit.UI Namespace